documents/user/state-user.mmd
---
title: User - State Diagram
---
stateDiagram-v2
    [*] --> ACTIVE : Register
    ACTIVE --> INACTIVE : Admin Ban
    INACTIVE --> ACTIVE : Admin Activate
